import os
from docx import Document
from docx.shared import Pt, Inches
from docx.enum.text import WD_ALIGN_PARAGRAPH
import datetime

def dostavka(vidstan_dostavku, kilkist_moduley=None):
    if vidstan_dostavku == 0:
        return "800 грн. Послуги вантажників сплачуються окремо за рахунок Покупця. Вартість заносу меблів по поверхах при відсутності або несправності вантажного ліфту складає 40 грн за поверх одного елементу."
    else:
        if kilkist_moduley is None:
            raise ValueError("Кількість модулів для доставки повинна бути вказана.")
        return f"{kilkist_moduley * 500 + 500} грн."

def create_document(number_dogovoru, name_buyer, item_for_buy, adress, phone, vidstan_dostavku, description, quantity,
                    price, avans, kilkist_moduley=None):
    # Розрахунки
    current_date = datetime.datetime.now().strftime('%d.%m.%Y')
    total = quantity * price
    doplata = total - avans

    # Створення документа
    doc = Document()
    doc.styles['Normal'].font.name = 'Times New Roman'
    doc.styles['Normal'].font.size = Pt(10.5)

    # Заголовок
    heading = doc.add_heading(f'ДОГОВІР КУПІВЛІ-ПРОДАЖУ МЕБЛІВ № {number_dogovoru}', level=1)
    heading.alignment = WD_ALIGN_PARAGRAPH.CENTER

    # Дата та вступ
    doc.add_paragraph(f'\nм. Київ «{current_date}»\n').alignment = WD_ALIGN_PARAGRAPH.RIGHT
    doc.add_paragraph(
        f'ФО-П Журавльов Олександр Володимирович, іменований надалі «Продавець», що діє на підставі виписки №895002, з однієї сторони і {name_buyer}, іменований надалі «Покупець», з іншої сторони, разом іменовані надалі «Сторони», уклали цей Договір про наступне:'
    )

    # Додавання таблиці
    table = doc.add_table(rows=1, cols=5)
    hdr_cells = table.rows[0].cells
    hdr_cells[0].text = '№ п / п'
    hdr_cells[1].text = 'Найменування'
    hdr_cells[2].text = 'К-сть (шт.)'
    hdr_cells[3].text = 'Ціна (грн.)'
    hdr_cells[4].text = 'Сума (грн.)'

    # Налаштування ширини колонок
    def set_column_widths(table):
        widths = [Inches(1.0), Inches(3.0), Inches(1.0), Inches(1.0), Inches(1.0)]
        for col, width in zip(table.columns, widths):
            for cell in col.cells:
                cell.width = width

    set_column_widths(table)

    # Додавання даних до таблиці
    row_cells = table.add_row().cells
    row_cells[0].text = '1'
    row_cells[1].text = description
    row_cells[2].text = str(quantity)
    row_cells[3].text = str(price)
    row_cells[4].text = str(total)

    # Підсумковий рядок
    row_cells = table.add_row().cells
    row_cells[0].text = ''
    row_cells[1].text = ''
    row_cells[2].text = ''
    row_cells[3].text = 'Підсумок'
    row_cells[4].text = str(total)

    # Додавання пунктів договору
    doc.add_paragraph(
        '1.3. В якості зразка Сторонами використовується конкретна модель меблів базової назви. У параметри моделі базової назви можуть бути внесені зміни за письмовою згодою Сторін. Узгодження комплектації і зовнішнього вигляду меблів здійснюється шляхом складання Специфікації (п.1.2. Договору).'
    )
    doc.add_paragraph(
        '1.4. Підписання договору купівлі-продажу меблів, може здійснюватися шляхом використання факсимільного відтворення підпису Продавцем та прирівнюється до оригінального.'
    )

    doc.add_heading('2. ЦІНА І ПОРЯДОК РОЗРАХУНКІВ', level=2)
    doc.add_paragraph(
        f'2.1. Ціна товару визначається в момент укладання Договору. Оплата товару здійснюється шляхом внесення Покупцем грошових коштів готівкою або на поточний рахунок Продавця.'
    )

    # Додаємо текст жирним шрифтом
    run = doc.add_paragraph().add_run('Реквізити для оплати:\n')
    run.bold = True

    # Додаємо текст звичайним шрифтом
    run = doc.add_paragraph().add_run(
        f'ФО-П Журавльов Олександр Володимирович\nАТ КБ «ПриватБанк» м. Київ, Код: 3274319113\nРахунок у форматі відповідно до стандарту IBAN:\nUA583052990000026005016801912\nПризначення: згідно договору купівлі-продажу меблів № {number_dogovoru} від {current_date}'
    )
    run.bold = True

    doc.add_paragraph(
        f'2.2. У момент укладання Договору Покупець вносить {avans} грн. Залишок від ціни товару, а саме {doplata} грн. Покупець вносить на рахунок Продавця під час передачі товару Покупцю.'
    )
    doc.add_paragraph(f'2.3. Ціна товару за цим договором {total} грн.')
    doc.add_paragraph(
        '2.4. Повідомлення Покупця проводиться за допомогою телефонного зв\'язку, або з використанням послуг Укрпошти.'
    )

    doc.add_heading('3. ПОРЯДОК ДОСТАВКИ та ТЕРМІН ВИГОТОВЛЕННЯ ТОВАРУ', level=2)
    doc.add_paragraph(
        f'3.1. Термін виготовлення товару, зазначеного у п.1.2., виконується в строк не пізніше {40} календарних днів, з дня внесення оплати авансу згідно п.2.2. Першим днем виготовлення товару вважається наступний робочий день від дати оформлення договору.'
    )
    doc.add_paragraph(
        '3.2. Термін доставки товару від Продавця до Покупця проводиться на протязі п’яти робочих днів, після закінчення терміну на виготовлення товару зазначеному у п.3.1. День і час доставки товару Покупцеві Сторони обумовлюють додатково.'
    )
    doc.add_paragraph(
        f'3.3. Доставка товару здійснюється силами Продавця та за рахунок Покупця, її вартість складає {dostavka(vidstan_dostavku, kilkist_moduley)}'
    )

    doc.add_heading('4. ОБОВ’ЯЗКИ СТОРІН', level=2)
    doc.add_paragraph(
        '4.1. Продавець зобов\'язаний до укладення цього Договору ознайомити Покупця з інформацією про основні споживчі властивості, матеріали, з яких виготовлені меблі і які використані при її обробці, місцем виготовлення, ціною, кольором, розміром, умовами придбання та доставки, термін служби, гарантійний термін та зразками товару, обумовленого у п.1.2.'
    )
    doc.add_paragraph(
        '4.2. Продавець зобов\'язаний передати товар, зазначений у п.1.2. Договору, Покупцеві в порядку і в терміни, встановлені в Договорі.'
    )
    doc.add_paragraph(
        '4.3. Продавець зобов\'язаний у наочній формі ознайомити Покупця з Правилами продажу окремих видів товарів, Правилами продажу товарів за зразками, Переліком непродовольчих товарів належної якості, що не підлягають поверненню або обміну на аналогічний товар інших розміру, форми, габариту, фасону, забарвлення або комплектації.'
    )
    doc.add_paragraph(
        '4.4. У разі порушення Продавцем строку доставки товару, встановленого у п.3.1. Договору, Продавець сплачує Покупцю за кожний день прострочення неустойку (пеню) у розмірі подвійної ставки НБУ від вартості товару. Неустойка (пеня) стягується з дня, коли за Договором купівлі-продажу передача товару Покупцеві повинна була бути здійснена до дня передачі товару Покупцеві або до дня задоволення вимоги Покупця про повернення йому попередньо сплаченої ним суми.'
    )
    doc.add_paragraph(
        '4.5. У разі якщо доставка товару проведена у встановлені терміни, але товар не був переданий Покупцю з його вини, нова доставка проводиться в нові терміни, узгоджені з Продавцем після повторної оплати Покупцем вартості послуги з доставки товару.'
    )
    doc.add_paragraph(
        '4.6. Покупець зобов\'язаний здійснити перевірку товару за кількістю та асортиментом і підписати відповідний відвантажувальний документ.'
    )

    doc.add_heading('5. ВІДПОВІДАЛЬНІСТЬ СТОРІН', level=2)
    doc.add_paragraph(
        '5.1. Право власності на товар переходить до Покупця в момент 100% оплати вартості товару, зазначеної в п.2.3. Договору.'
    )
    doc.add_paragraph(
        '5.2. Кожна зі сторін зобов\'язана виконувати свої зобов\'язання належним чином, здійснюючи можливе сприяння іншій Стороні.'
    )
    doc.add_paragraph(
        '5.3. Сторони несуть відповідальність за невиконання або неналежне виконання своїх обов\'язків відповідно до Договору і Цивільного кодексу України.'
    )
    doc.add_paragraph(
        '5.4. Спори і розбіжності, що виникають між Сторонами, вирішуються шляхом переговорів у відповідності з чинним законодавством України. Сторони зобов\'язані вжити всіх заходів для вирішення розбіжностей в досудовому порядку.'
    )
    doc.add_paragraph(
        '5.5. Сторони звільняються від відповідальності за часткове або повне невиконання зобов\'язань за Договором, якщо таке невиконання викликане обставинами непереборної сили (форс-мажорні обставини).'
    )

    doc.add_heading('6. ТЕРМІН ДІЇ ДОГОВОРУ', level=2)
    doc.add_paragraph(
        '6.1. Договір набуває чинності з моменту його підписання та внесення оплати авансу за товар.'
    )
    doc.add_paragraph(
        '6.2. Договір вважається виконаним з моменту закінчення виконання зобов\'язань Сторонами.'
    )

    doc.add_heading('7. АДРЕСИ ТА РЕКВІЗИТИ СТОРІН', level=2)
    doc.add_paragraph(
        f'''ПРОДАВЕЦЬ:\nФО-П Журавльов Олександр Володимирович\nВиписка №895002 ІПН 3274319113\nРахунок у форматі відповідно до стандарту IBAN:\nUA 58 305299 00000 26005016801912\nАТ КБ "ПРИВАТБАНК" м.Київ\n04050 м. Київ, вул. Житньоторзька 8\n\n
        ПОКУПЕЦЬ:\n{name_buyer}\n{adress}\nТел.: {phone}\n\n\n\n\n_______________________\n      Підпис'''
    )

    # Перевірка наявності зображення
    img_path = 'img.png'
    if os.path.exists(img_path):
        doc.add_picture(img_path, width=Pt(250))
    else:
        doc.add_paragraph('Зображення не знайдено.')

    # Визначення шляху для збереження файлу
    base_path = r"E:\Робота Гугл Диск\.shortcut-targets-by-id\0BwGxeScX7t3cdEZCcTh3UmMzSDQ\клиенты\Выписанные договора без предоплаты"
    folder_name = f'{number_dogovoru}_{name_buyer}_{item_for_buy}'
    folder_path = os.path.join(base_path, folder_name)

    os.makedirs(folder_path, exist_ok=True)

    file_path = os.path.join(folder_path, f'{number_dogovoru}_{name_buyer}_{item_for_buy}.docx')

    doc.save(file_path)

    return file_path
